Revit 2026 API

# FilterNumericValueRuleSetEvaluator Method

---

Sets the evaluator that implements the test for this rule.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetEvaluator(
	FilterNumericRuleEvaluator evaluator
)
```
```vb
Public Sub SetEvaluator (
	evaluator As FilterNumericRuleEvaluator
)
```
```cpp
public:
void SetEvaluator(
	FilterNumericRuleEvaluator^ evaluator
)
```
```fsharp
member SetEvaluator :
        evaluator : FilterNumericRuleEvaluator -> unit
```

#### Parameters

evaluator FilterNumericRuleEvaluator

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FilterNumericValueRule Class

Autodesk.Revit.DB Namespace